; domain
(define (domain logistics-strips)
  (:requirements :strips) 
  (:predicates 	(OBJ ?obj)
	       	(TRUCK ?truck)
               	(LOCATION ?loc)
		(AIRPLANE ?airplane)
                (CITY ?city)
                (AIRPORT ?airport)
		(at ?obj ?loc)
		(in ?obj1 ?obj2)
		(in-city ?obj ?city))
 
  ; (:types )		; default object

(:action LOAD-TRUCK
  :parameters
   (?obj
    ?truck
    ?loc)
  :precondition
   (and (OBJ ?obj) (TRUCK ?truck) (LOCATION ?loc)
   (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action LOAD-AIRPLANE
  :parameters
   (?obj
    ?airplane
    ?loc)
  :precondition
   (and (OBJ ?obj) (AIRPLANE ?airplane) (LOCATION ?loc)
   (at ?obj ?loc) (at ?airplane ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?airplane)))

(:action UNLOAD-TRUCK
  :parameters
   (?obj
    ?truck
    ?loc)
  :precondition
   (and (OBJ ?obj) (TRUCK ?truck) (LOCATION ?loc)
        (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action UNLOAD-AIRPLANE
  :parameters
   (?obj
    ?airplane
    ?loc)
  :precondition
   (and (OBJ ?obj) (AIRPLANE ?airplane) (LOCATION ?loc)
        (in ?obj ?airplane) (at ?airplane ?loc))
  :effect
   (and (not (in ?obj ?airplane)) (at ?obj ?loc)))

(:action DRIVE-TRUCK
  :parameters
   (?truck
    ?loc-from
    ?loc-to
    ?city)
  :precondition
   (and (TRUCK ?truck) (LOCATION ?loc-from) (LOCATION ?loc-to) (CITY ?city)
   (at ?truck ?loc-from)
   (in-city ?loc-from ?city)
   (in-city ?loc-to ?city))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action FLY-AIRPLANE
  :parameters
   (?airplane
    ?loc-from
    ?loc-to)
  :precondition
   (and (AIRPLANE ?airplane) (AIRPORT ?loc-from) (AIRPORT ?loc-to)
	(at ?airplane ?loc-from))
  :effect
   (and (not (at ?airplane ?loc-from)) (at ?airplane ?loc-to)))
)

; problem
(define (problem logistics-c4-s1-p15-a1)
(:domain logistics-strips)
(:objects a0 
          c0 c1 c2 c3 
          t0 t1 t2 t3 
          l0-0 l1-0 l2-0 l3-0 
          p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 p13 p14 
)
(:init
    (AIRPLANE a0)
    (CITY c0)
    (CITY c1)
    (CITY c2)
    (CITY c3)
    (TRUCK t0)
    (TRUCK t1)
    (TRUCK t2)
    (TRUCK t3)
    (LOCATION l0-0)
    (in-city  l0-0 c0)
    (LOCATION l1-0)
    (in-city  l1-0 c1)
    (LOCATION l2-0)
    (in-city  l2-0 c2)
    (LOCATION l3-0)
    (in-city  l3-0 c3)
    (AIRPORT l0-0)
    (AIRPORT l1-0)
    (AIRPORT l2-0)
    (AIRPORT l3-0)
    (OBJ p0)
    (OBJ p1)
    (OBJ p2)
    (OBJ p3)
    (OBJ p4)
    (OBJ p5)
    (OBJ p6)
    (OBJ p7)
    (OBJ p8)
    (OBJ p9)
    (OBJ p10)
    (OBJ p11)
    (OBJ p12)
    (OBJ p13)
    (OBJ p14)
    (at t0 l0-0)
    (at t1 l1-0)
    (at t2 l2-0)
    (at t3 l3-0)
    (at p0 l2-0)
    (at p1 l3-0)
    (at p2 l1-0)
    (at p3 l0-0)
    (at p4 l1-0)
    (at p5 l1-0)
    (at p6 l3-0)
    (at p7 l3-0)
    (at p8 l3-0)
    (at p9 l0-0)
    (at p10 l1-0)
    (at p11 l2-0)
    (at p12 l0-0)
    (at p13 l2-0)
    (at p14 l3-0)
    (at a0 l1-0)
)
(:goal
    (and
        (at p0 l3-0)
        (at p1 l3-0)
        (at p2 l3-0)
        (at p3 l3-0)
        (at p4 l2-0)
        (at p5 l0-0)
        (at p6 l0-0)
        (at p7 l3-0)
        (at p8 l0-0)
        (at p9 l2-0)
        (at p10 l0-0)
        (at p11 l1-0)
        (at p12 l3-0)
        (at p13 l2-0)
        (at p14 l0-0)
    )
)
)

; plan
1. (load-airplane p5 a0 l1-0)
   deleted: (at p5 l1-0)
   added: (in p5 a0)
   goals met: 3 of 15
2. (load-airplane p4 a0 l1-0)
   deleted: (at p4 l1-0)
   added: (in p4 a0)
   goals met: 3 of 15
3. (load-airplane p2 a0 l1-0)
   deleted: (at p2 l1-0)
   added: (in p2 a0)
   goals met: 3 of 15
4. (load-airplane p10 a0 l1-0)
   deleted: (at p10 l1-0)
   added: (in p10 a0)
   goals met: 3 of 15
5. (fly-airplane a0 l1-0 l0-0)
   deleted: (at a0 l1-0)
   added: (at a0 l0-0)
   goals met: 3 of 15
6. (load-airplane p9 a0 l0-0)
   deleted: (at p9 l0-0)
   added: (in p9 a0)
   goals met: 3 of 15
7. (unload-airplane p5 a0 l0-0)
   deleted: (in p5 a0)
   added: (at p5 l0-0)
   goals met: 4 of 15
8. (load-airplane p3 a0 l0-0)
   deleted: (at p3 l0-0)
   added: (in p3 a0)
   goals met: 4 of 15
9. (load-airplane p12 a0 l0-0)
   deleted: (at p12 l0-0)
   added: (in p12 a0)
   goals met: 4 of 15
10. (unload-airplane p10 a0 l0-0)
   deleted: (in p10 a0)
   added: (at p10 l0-0)
   goals met: 5 of 15
11. (fly-airplane a0 l0-0 l2-0)
   deleted: (at a0 l0-0)
   added: (at a0 l2-0)
   goals met: 5 of 15
12. (unload-airplane p9 a0 l2-0)
   deleted: (in p9 a0)
   added: (at p9 l2-0)
   goals met: 6 of 15
13. (unload-airplane p4 a0 l2-0)
   deleted: (in p4 a0)
   added: (at p4 l2-0)
   goals met: 7 of 15
14. (load-airplane p11 a0 l2-0)
   deleted: (at p11 l2-0)
   added: (in p11 a0)
   goals met: 7 of 15
15. (load-airplane p0 a0 l2-0)
   deleted: (at p0 l2-0)
   added: (in p0 a0)
   goals met: 7 of 15
16. (fly-airplane a0 l2-0 l1-0)
   deleted: (at a0 l2-0)
   added: (at a0 l1-0)
   goals met: 7 of 15
17. (unload-airplane p11 a0 l1-0)
   deleted: (in p11 a0)
   added: (at p11 l1-0)
   goals met: 8 of 15
18. (fly-airplane a0 l1-0 l3-0)
   deleted: (at a0 l1-0)
   added: (at a0 l3-0)
   goals met: 8 of 15
19. (load-airplane p8 a0 l3-0)
   deleted: (at p8 l3-0)
   added: (in p8 a0)
   goals met: 8 of 15
20. (load-airplane p6 a0 l3-0)
   deleted: (at p6 l3-0)
   added: (in p6 a0)
   goals met: 8 of 15
21. (unload-airplane p3 a0 l3-0)
   deleted: (in p3 a0)
   added: (at p3 l3-0)
   goals met: 9 of 15
22. (unload-airplane p2 a0 l3-0)
   deleted: (in p2 a0)
   added: (at p2 l3-0)
   goals met: 10 of 15
23. (load-airplane p14 a0 l3-0)
   deleted: (at p14 l3-0)
   added: (in p14 a0)
   goals met: 10 of 15
24. (unload-airplane p12 a0 l3-0)
   deleted: (in p12 a0)
   added: (at p12 l3-0)
   goals met: 11 of 15
25. (unload-airplane p0 a0 l3-0)
   deleted: (in p0 a0)
   added: (at p0 l3-0)
   goals met: 12 of 15
26. (fly-airplane a0 l3-0 l0-0)
   deleted: (at a0 l3-0)
   added: (at a0 l0-0)
   goals met: 12 of 15
27. (unload-airplane p8 a0 l0-0)
   deleted: (in p8 a0)
   added: (at p8 l0-0)
   goals met: 13 of 15
28. (unload-airplane p6 a0 l0-0)
   deleted: (in p6 a0)
   added: (at p6 l0-0)
   goals met: 14 of 15
29. (unload-airplane p14 a0 l0-0)
   deleted: (in p14 a0)
   added: (at p14 l0-0)
   goals met: 15 of 15
